Revit 2027 API
FluidType.Create(Document, String) Method
 Creates a new empty fluid type and adds it to the document.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FluidType Create(
	Document document,
	string fluidTypeName
)
Public Shared Function Create (
	document As Document,
	fluidTypeName As String
) As FluidType
public:
static FluidType^ Create(
	Document^ document,
	String^ fluidTypeName
)
static member Create :
        document : Document *
        fluidTypeName : string -> FluidType
Parameters
document Document
 The document.
fluidTypeName String
 The name of fluid type.
Return Value
FluidType
 The newly created fluid type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FluidType Class
Create Overload
Autodesk.Revit.DB.Plumbing Namespace